# Example for String operation using find command

In [3]:
string = 'rahululul'
lookingfor = input('What are you looking for: ')
flag = False
pos = -1
n = len(string)
while True:
    pos = string.find(lookingfor, pos+1, n)
    if pos==-1:
        break
    else:
        print('Found at index: ', pos)
        flag = True
if flag == False:
    print('Not Found')

What are you looking for: l
Found at index:  4
Found at index:  6
Found at index:  8

# Regular Expressions

In [4]:
import re

**Regular Expression Documentation https://docs.python.org/3/library/re.html**

Important RE module functions 

finditer()

match()

fullmatch()

search()

findall()

sub()

subn()

split()

**Finditer() - It finds the iteration of the characters**

**[abc] - We are looking for a or b or c**

**[^abc] - We are looking for except a or b or c**

**[a-z] - All the small letters**

**[A-Z] - All the capital letters**

**[a-zA-Z] - All letter no matter its caps or small**

**[0-9] - All the numbers**

**[a-zA-Z0-9] - All the numbers and alphabets**

**[^a-zA-Z0-9] - All the special characters**

In [6]:
for i in re.finditer('[abc]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
2 ... 3 ... b
3 ... 4 ... a
6 ... 7 ... c

In [7]:
for i in re.finditer('[^abc]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

1 ... 2 ... 7
4 ... 5 ... @
5 ... 6 ... k
7 ... 8 ... 9
8 ... 9 ... z
9 ... 10 ... x
10 ... 11 ...

In [8]:
for i in re.finditer('[a-z]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
2 ... 3 ... b
3 ... 4 ... a
5 ... 6 ... k
6 ... 7 ... c
8 ... 9 ... z
9 ... 10 ... x

In [9]:
for i in re.finditer('[A-Z]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

In [10]:
for i in re.finditer('[a-zA-Z]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
2 ... 3 ... b
3 ... 4 ... a
5 ... 6 ... k
6 ... 7 ... c
8 ... 9 ... z
9 ... 10 ... x

In [11]:
for i in re.finditer('[0-9]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

1 ... 2 ... 7
7 ... 8 ... 9

In [12]:
for i in re.finditer('[a-zA-Z0-9]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
1 ... 2 ... 7
2 ... 3 ... b
3 ... 4 ... a
5 ... 6 ... k
6 ... 7 ... c
7 ... 8 ... 9
8 ... 9 ... z
9 ... 10 ... x

In [13]:
for i in re.finditer('[^a-zA-Z0-9]','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

4 ... 5 ... @
10 ... 11 ...

**\d -Any numbers**

**\s - spaces**

**\S - Except space**

**\D - Except numbers**

**\w - Alphanumeric**

**\W - Except alphanumeric**

**. - All the characters including special characters**

In [14]:
for i in re.finditer('\d','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

1 ... 2 ... 7
7 ... 8 ... 9

In [15]:
for i in re.finditer('\s','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

10 ... 11 ...

In [16]:
for i in re.finditer('\S','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
1 ... 2 ... 7
2 ... 3 ... b
3 ... 4 ... a
4 ... 5 ... @
5 ... 6 ... k
6 ... 7 ... c
7 ... 8 ... 9
8 ... 9 ... z
9 ... 10 ... x

In [17]:
for i in re.finditer('\D','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
2 ... 3 ... b
3 ... 4 ... a
4 ... 5 ... @
5 ... 6 ... k
6 ... 7 ... c
8 ... 9 ... z
9 ... 10 ... x
10 ... 11 ...

In [18]:
for i in re.finditer('\w','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
1 ... 2 ... 7
2 ... 3 ... b
3 ... 4 ... a
5 ... 6 ... k
6 ... 7 ... c
7 ... 8 ... 9
8 ... 9 ... z
9 ... 10 ... x

In [19]:
for i in re.finditer('\W','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

4 ... 5 ... @
10 ... 11 ...

In [20]:
for i in re.finditer('.','a7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... a
1 ... 2 ... 7
2 ... 3 ... b
3 ... 4 ... a
4 ... 5 ... @
5 ... 6 ... k
6 ... 7 ... c
7 ... 8 ... 9
8 ... 9 ... z
9 ... 10 ... x
10 ... 11 ...

**In the below code we are looking for abc together**

In [22]:
for i in re.finditer('abc', 'abc7ba@kc9zx '):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 3 ... abc

**In the below code we are getting all the instances of c**

In [27]:
for i in re.finditer('c', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... c
2 ... 3 ... c
3 ... 4 ... c
5 ... 6 ... c
6 ... 7 ... c
7 ... 8 ... c

In [26]:
for i in re.finditer('[c]', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... c
2 ... 3 ... c
3 ... 4 ... c
5 ... 6 ... c
6 ... 7 ... c
7 ... 8 ... c

**In the below code we are looking for cd together however in the next code we are looking for either c or d**

In [28]:
for i in re.finditer('cd', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 2 ... cd
3 ... 5 ... cd
7 ... 9 ... cd

In [29]:
for i in re.finditer('[cd]', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... c
1 ... 2 ... d
2 ... 3 ... c
3 ... 4 ... c
4 ... 5 ... d
5 ... 6 ... c
6 ... 7 ... c
7 ... 8 ... c
8 ... 9 ... d

**The below code will give me atleast 1 c or any number of continous c's**

In [30]:
for i in re.finditer('c+', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... c
2 ... 4 ... cc
5 ... 8 ... ccc

**In this code we are getting any number of c's including 0**

In [31]:
for i in re.finditer('c*', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... c
1 ... 1 ...
2 ... 4 ... cc
4 ... 4 ...
5 ... 8 ... ccc
8 ... 8 ...
9 ... 9 ...

**In the below code we are getting atmost 1 c**

In [32]:
for i in re.finditer('c?', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... c
1 ... 1 ...
2 ... 3 ... c
3 ... 4 ... c
4 ... 4 ...
5 ... 6 ... c
6 ... 7 ... c
7 ... 8 ... c
8 ... 8 ...
9 ... 9 ...

**In the below code we are getting c{n} - n c's , in the below example we are getting 2 c's**

In [37]:
for i in re.finditer('c{2}', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

2 ... 4 ... cc
5 ... 7 ... cc

**In the below code we are getting c{n,m} i.e. either n numbers of c's or m number c's , in the below example we are getting 2 or 3 number of c's**

In [38]:
for i in re.finditer('c{2,3}', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

2 ... 4 ... cc
5 ... 8 ... ccc

**Except c**

In [39]:
for i in re.finditer('[^c]', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

1 ... 2 ... d
4 ... 5 ... d
8 ... 9 ... d

**It is checking if the string is starting with c or not**

In [42]:
for i in re.finditer('^c', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

0 ... 1 ... c

**When we are looking ending position of a string we can pass $, in the below example we are looking for if its ending with d or not**

In [43]:
for i in re.finditer('d$', 'cdccdcccd'):
    print(i.start(), '...', i.end(), '...', i.group())

8 ... 9 ... d

**Match() - It looks for characters from the start till any position**

In [50]:
string = 'Python is one of the most powerful languages'
lookingfor = input('What are you looking for: ')

if re.match(lookingfor,string)!=None:
    print('Match Found')
else:
    print('Match did not find')

What are you looking for: one
Match did not find

**Fullmatch() - It looks for characters from the start till the end**

In [53]:
string = 'Python is one of the most powerful languages'
lookingfor = input('What are you looking for: ')

if re.fullmatch(lookingfor,string)!=None:
    print('Match Found')
else:
    print('Match did not find')

What are you looking for: Python is one of the most powerful languages
Match Found

**Search() - It looks for any character in the string, you can search any character, there is no limitation that we have to look from the start or something**

In [56]:
string = 'Python is one of the most powerful languages'
lookingfor = input('What are you looking for: ')

if re.search(lookingfor,string)!=None:
    print('Match Found')
else:
    print('Match did not find')

What are you looking for: java
Match did not find

**Findall() - It will look for all the instances of the string which we are looking for**

In [61]:
resume = 'Python is powerful, Python is good, Python is the future, Python is open source'
keyword = input('What keyword are you looking for: ')

if len(re.findall(keyword, resume))>3:
    print('Your resume got selected')
else:
    print('Your resume got rejected')

What keyword are you looking for: Python
Your resume got selected

**Sub() - It will substitute the values which we want to replace**

In [62]:
resume = 'Python is powerful, Python is good, Python is the future, Python is open source'
whattochange = input('What you want to change: ')
Withwhat = input('What value you want: ')

re.sub(whattochange,Withwhat,resume)

What you want to change: Python
What value you want: Java

'Java is powerful, Java is good, Java is the future, Java is open source'

**Subn() - It will substitute the values which we want to replace, it will give the output in the form of a tuple, in that tuple we will have the replaced string and how many times the replacement happend that number will come**

In [63]:
resume = 'Python is powerful, Python is good, Python is the future, Python is open source'
whattochange = input('What you want to change: ')
Withwhat = input('What value you want: ')

re.subn(whattochange,Withwhat,resume)

What you want to change: Python
What value you want: Java

('Java is powerful, Java is good, Java is the future, Java is open source', 4)

**split() - It splits based on the delimiter**

In [64]:
re.split('-', '10-20-30-40-50-60')

['10', '20', '30', '40', '50', '60']

**\ is an escape character which can help python understand that . is not part of the code, it is a part of the string which we are looking for**

In [66]:
re.split('\.', 'www.iciciprulife.com')

['www', 'iciciprulife', 'com']

In [67]:
re.split('[.]', 'www.iciciprulife.com')

['www', 'iciciprulife', 'com']

In [68]:
string = 'Learning Python is very easy'
re.search('^Learn', string)

In [69]:
re.search('easy$', string)

**IGNORECASE will ignore the case, it is making it case insensetive**

In [71]:
re.search('Easy$', string, re.IGNORECASE)

**1) Password Selection**

    a) The allowable characters should be
        a.1) Alphabets (A-Z,a-z)
        a.2) Digits (0-9)
        a.3) Hash - (#)
            
    b) First character should be a lowercase that too between (a-k)
    c) Second character should be a number which is divisble by 3 i.e. 0,3,6,9
    d) The length of the password 
        d.1) Should be exactly 5
        d.2) Should be minimum 5

**Scenario 1** - Where the password length is exactly 5

In [75]:
password = input('Create the password: ')
if re.fullmatch('[a-k][0369][a-zA-Z0-9#]{3}',password)!=None:
    print('The password you selected is fine', password)
else:
    print('The password needs to be changed', password)

Create the password: a31234
The password needs to be changed a31234

**Scenario 2** - Where the password length is minimum 5

In [83]:
password = input('Create the password: ')
if re.fullmatch('[a-k][0369][a-zA-Z0-9#]{3,}',password)!=None:
    print('The password you selected is fine', password)
else:
    print('The password needs to be changed', password)

Create the password: a3###
The password you selected is fine a3###

**2) Pan Card Verification**

In [86]:
pancard = input('Enter the pancard number: ')
if re.fullmatch('[A-Z]{3}[CPHFATBLJG][A-Z][0-9]{4}[A-Z]',pancard):
    print('The pancard you passed is correct: ', pancard)
else:
    print('The pancard you passed is incorrect: ', pancard)

Enter the pancard number: 1AFUP1212K
The pancard you passed is incorrect:  1AFUP1212K

**3) Phone number verification**

In [87]:
phone = input('Enter the phone number: ')
if re.fullmatch('[6-9]\d{9}',phone)!=None:
    print('The phone number is valid', phone)
else:
    print('The phone number is invalid', phone)

Enter the phone number: 9643393302
The phone number is valid 9643393302

**4) Email check**

In [90]:
email = input('Enter the email: ')
if re.fullmatch('[a-zA-Z0-9_.]*@gmail[.]com',email)!=None:
    print('You are eligible for the offer')
else:
    print('You are not eligible for the offer')

Enter the email: rahul@yhoo.com
You are not eligible for the offer

In [91]:
email = input('Enter the email: ')
if re.fullmatch('[a-zA-Z0-9_.]*@(gmail|yahoo)[.]com',email)!=None:
    print('You are eligible for the offer')
else:
    print('You are not eligible for the offer')

Enter the email: rahul@yahoo.com
You are eligible for the offer

In [92]:
email = input('Enter the email: ')
if re.fullmatch('[a-zA-Z0-9_.]*@[a-zA-Z0-9]*[.]com',email)!=None:
    print('You are eligible for the offer')
else:
    print('You are not eligible for the offer')

Enter the email: rahul@iciciprulife.com
You are eligible for the offer

In [94]:
email = input('Enter the email: ')
if re.fullmatch('[a-zA-Z0-9_.]*@[a-zA-Z0-9]*[.][a-zA-Z]*',email)!=None:
    print('You are eligible for the offer')
else:
    print('You are not eligible for the offer')

Enter the email: rahul@gmail.in
You are eligible for the offer

**5) Reading the data from the site and get all the phone numbers**

In [96]:
import urllib.request
url = 'https://www.summet.com/dmsi/html/codesamples/addresses.html'
response = urllib.request.urlopen(url)
data = response.read()
data = data.decode()
data

'<html>\n<head>\n\t<title>Sample Addresses!</title>\n<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-2760663110461940"\n     crossorigin="anonymous"></script>\n\n</head>\n<body>\n<h1> A page full of sample addresses for your parsing enjoyment!</h1>\n<h2> (All data is random....)</h2>\n<ul>\n\n<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-2760663110461940"\n     crossorigin="anonymous"></script>\n<!-- summet.com-dmsi-addresses -->\n<ins class="adsbygoogle"\n     style="display:block"\n     data-ad-client="ca-pub-2760663110461940"\n     data-ad-slot="5472586510"\n     data-ad-format="auto"\n     data-full-width-responsive="true"></ins>\n<script>\n     (adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n<li>Cecilia Chapman<br/>711-2880 Nulla St.<br/>Mankato Mississippi 96522<br/>(257) 563-7401</li>\n<li>Iris Watson<br/>P.O. Box 283 8562 Fusce Rd.<br/>Frederick Nebraska 20620<br/>(372) 587-2335</li>\n<li>Celeste Slater<br/>606-3727 Ullamcorper. Street<br/>Roseville NH 11523<br/>(786) 713-8616</li>\n<li>Theodore Lowe<br/>Ap #867-859 Sit Rd.<br/>Azusa New York 39531<br/>(793) 151-6230</li>\n<li>Calista Wise<br/>7292 Dictum Av.<br/>San Antonio MI 47096<br/>(492) 709-6392</li>\n<li>Kyla Olsen<br/>Ap #651-8679 Sodales Av.<br/>Tamuning PA 10855<br/>(654) 393-5734</li>\n<li>Forrest Ray<br/>191-103 Integer Rd.<br/>Corona New Mexico 08219<br/>(404) 960-3807</li>\n<li>Hiroko Potter<br/>P.O. Box 887 2508 Dolor. Av.<br/>Muskegon KY 12482<br/>(314) 244-6306</li>\n<li>Nyssa Vazquez<br/>511-5762 At Rd.<br/>Chelsea MI 67708<br/>(947) 278-5929</li>\n<li>Lawrence Moreno<br/>935-9940 Tortor. Street<br/>Santa Rosa MN 98804<br/>(684) 579-1879</li>\n<li>Ina Moran<br/>P.O. Box 929 4189 Nunc Road<br/>Lebanon KY 69409<br/>(389) 737-2852</li>\n<li>Aaron Hawkins<br/>5587 Nunc. Avenue<br/>Erie Rhode Island 24975<br/>(660) 663-4518</li>\n<li>Hedy Greene<br/>Ap #696-3279 Viverra. Avenue<br/>Latrobe DE 38100<br/>(608) 265-2215</li>\n<li>Melvin Porter<br/>P.O. Box 132 1599 Curabitur Rd.<br/>Bandera South Dakota 45149<br/>(959) 119-8364</li>\n<li>Keefe Sellers<br/>347-7666 Iaculis St.<br/>Woodruff SC 49854<br/>(468) 353-2641</li>\n<li>Joan Romero<br/>666-4366 Lacinia Avenue<br/>Idaho Falls Ohio 19253<br/>(248) 675-4007</li>\n<li>Davis Patrick<br/>P.O. Box 147 2546 Sociosqu Rd.<br/>Bethlehem Utah 02913<br/>(939) 353-1107</li>\n<li>Leilani Boyer<br/>557-6308 Lacinia Road<br/>San Bernardino ND 09289<br/>(570) 873-7090</li>\n<li>Colby Bernard<br/>Ap #285-7193 Ullamcorper Avenue<br/>Amesbury HI 93373<br/>(302) 259-2375</li>\n<li>Bryar Pitts<br/>5543 Aliquet St.<br/>Fort Dodge GA 20783<br/>(717) 450-4729</li>\n<li>Rahim Henderson<br/>5037 Diam Rd.<br/>Daly City Ohio 90255<br/>(453) 391-4650</li>\n<li>Noelle Adams<br/>6351 Fringilla Avenue<br/>Gardena Colorado 37547<br/>(559) 104-5475</li>\n<li>Lillith Daniel<br/>935-1670 Neque. St.<br/>Centennial Delaware 48432<br/>(387) 142-9434</li>\n<li>Adria Russell<br/>414-7533 Non Rd.<br/>Miami Beach North Dakota 58563<br/>(516) 745-4496</li>\n<li>Hilda Haynes<br/>778-9383 Suspendisse Av.<br/>Weirton IN 93479<br/>(326) 677-3419</li>\n<li>Sheila Mcintosh<br/>P.O. Box 360 4407 Et Rd.<br/>Santa Monica FL 30309<br/>(746) 679-2470</li>\n<li>Rebecca Chambers<br/>P.O. Box 813 5982 Sit Ave<br/>Liberal Vermont 51324<br/>(455) 430-0989</li>\n<li>Christian Emerson<br/>P.O. Box 886 4118 Arcu St.<br/>Rolling Hills Georgia 92358<br/>(490) 936-4694</li>\n<li>Nevada Ware<br/>P.O. Box 597 4156 Tincidunt Ave<br/>Green Bay Indiana 19759<br/>(985) 834-8285</li>\n<li>Margaret Joseph<br/>P.O. Box 508 3919 Gravida St.<br/>Tamuning Washington 55797<br/>(662) 661-1446</li>\n<li>Edward Nieves<br/>928-3313 Vel Av.<br/>Idaho Falls Rhode Island 37232<br/>(802) 668-8240</li>\n<li>Imani Talley<br/>P.O. Box 262 4978 Sit St.<br/>Yigo Massachusetts 50654<br/>(477) 768-9247</li>\n<li>Bertha Riggs<br/>P.O. Box 206 6639 In St.<br/>Easthampton TN 31626<br/>(791) 239-9057</li>\n<li>Wallace Ross<br/>313 Pellentesque Ave<br/>Villa Park Hawaii 43526<br/>(832) 109-0213</li>\n<li>Chester Bennett<br/>3476 Aliquet. Ave<br/>Minot AZ 95302<br/>(837) 196-3274</li>\n<li>Castor Richardson<br/>P.O. Box 902 3472 Ullamcorper Street<br/>Lynchburg DC 29738<br/>(268) 442-2428</li>\n<li>Sonya Jordan<br/>Ap #443-336 Ullamcorper. Street<br/>Visalia VA 54886<br/>(850) 676-5117</li>\n<li>Harrison Mcguire<br/>574-8633 Arcu Street<br/>San Fernando ID 77373<br/>(861) 546-5032</li>\n<li>Malcolm Long<br/>9291 Proin Road<br/>Lake Charles Maine 11292<br/>(176) 805-4108</li>\n<li>Raymond Levy<br/>Ap #643-7006 Risus St.<br/>Beaumont New Mexico 73585<br/>(715) 912-6931</li>\n<li>Hedley Ingram<br/>737-2580 At Street<br/>Independence Texas 87535<br/>(993) 554-0563</li>\n<li>David Mathews<br/>1011 Malesuada Road<br/>Moscow Kentucky 77382<br/>(357) 616-5411</li>\n<li>Xyla Cash<br/>969-1762 Tincidunt Rd.<br/>Boise CT 35282<br/>(121) 347-0086</li>\n<li>Madeline Gregory<br/>977-4841 Ut Ave<br/>Walla Walla Michigan 82776<br/>(304) 506-6314</li>\n<li>Griffith Daniels<br/>6818 Eget St.<br/>Tacoma AL 92508<br/>(425) 288-2332</li>\n<li>Anne Beasley<br/>987-4223 Urna St.<br/>Savannah Illinois 85794<br/>(145) 987-4962</li>\n<li>Chaney Bennett<br/>P.O. Box 721 902 Dolor Rd.<br/>Fremont AK 19408<br/>(187) 582-9707</li>\n<li>Daniel Bernard<br/>P.O. Box 567 1561 Duis Rd.<br/>Pomona TN 08609<br/>(750) 558-3965</li>\n<li>Willow Hunt<br/>Ap #784-1887 Lobortis Ave<br/>Cudahy Ohio 31522<br/>(492) 467-3131</li>\n<li>Judith Floyd<br/>361-7936 Feugiat St.<br/>Williston Nevada 58521<br/>(774) 914-2510</li>\n<li>Seth Farley<br/>6216 Aenean Avenue<br/>Seattle Utah 81202<br/>(888) 106-8550</li>\n<li>Zephania Sanders<br/>3714 Nascetur St.<br/>Hawthorne Louisiana 10626<br/>(539) 567-3573</li>\n<li>Calista Merritt<br/>Ap #938-5470 Posuere Ave<br/>Chickasha LA 58520<br/>(693) 337-2849</li>\n<li>Craig Williams<br/>P.O. Box 372 5634 Montes Rd.<br/>Springdale MO 57692<br/>(545) 604-9386</li>\n<li>Lee Preston<br/>981 Eget Rd.<br/>Clemson GA 04645<br/>(221) 156-5026</li>\n<li>Katelyn Cooper<br/>6059 Sollicitudin Road<br/>Burlingame Colorado 26278<br/>(414) 876-0865</li>\n<li>Lacy Eaton<br/>1379 Nulla. Av.<br/>Asbury Park Montana 69679<br/>(932) 726-8645</li>\n<li>Driscoll Leach<br/>P.O. Box 120 2410 Odio Avenue<br/>Pass Christian Delaware 03869<br/>(726) 710-9826</li>\n<li>Merritt Watson<br/>P.O. Box 686 7014 Amet Street<br/>Corona Oklahoma 55246<br/>(622) 594-1662</li>\n<li>Nehru Holmes<br/>P.O. Box 547 4764 Sed Road<br/>Grand Rapids CT 87323<br/>(948) 600-8503</li>\n<li>Quamar Rivera<br/>427-5827 Ac St.<br/>Schaumburg Arkansas 84872<br/>(605) 900-7508</li>\n<li>Hiram Mullins<br/>754-6427 Nunc Ave<br/>Kennewick AL 41329<br/>(716) 977-5775</li>\n<li>Kim Fletcher<br/>Ap #345-3847 Metus Road<br/>Independence CO 30135<br/>(368) 239-8275</li>\n<li>Rigel Koch<br/>P.O. Box 558 9561 Lacus. Road<br/>Laughlin Hawaii 99602<br/>(725) 342-0650</li>\n<li>Jeanette Sharpe<br/>Ap #364-2006 Ipsum Avenue<br/>Wilmington Ohio 91750<br/>(711) 993-5187</li>\n<li>Dahlia Lee<br/>1293 Tincidunt Street<br/>Atwater Pennsylvania 76865<br/>(882) 399-5084</li>\n<li>Howard Hayden<br/>P.O. Box 847 8019 Facilisis Street<br/>Joliet SC 73490<br/>(287) 755-9948</li>\n<li>Hyatt Kramer<br/>1011 Massa Av.<br/>Kent ID 63725<br/>(659) 551-3389</li>\n<li>Sonya Ray<br/>Ap #315-8441 Eleifend Street<br/>Fairbanks RI 96892<br/>(275) 730-6868</li>\n<li>Cara Whitehead<br/>4005 Praesent St.<br/>Torrance Wyoming 22767<br/>(725) 757-4047</li>\n<li>Blythe Carroll<br/>7709 Justo. Ave<br/>Princeton TX 77987<br/>(314) 882-1496</li>\n<li>Dale Griffin<br/>P.O. Box 854 8580 In Ave<br/>Revere South Dakota 43841<br/>(639) 360-7590</li>\n<li>McKenzie Hernandez<br/>Ap #367-674 Mi Street<br/>Greensboro VT 40684<br/>(168) 222-1592</li>\n<li>Haviva Holcomb<br/>P.O. Box 642 3450 In Road<br/>Isle of Palms New York 03828<br/>(896) 303-1164</li>\n<li>Ezra Duffy<br/>Ap #782-7348 Dis Rd.<br/>Austin KY 50710<br/>(203) 982-6130</li>\n<li>Eleanor Jennings<br/>9631 Semper Ave<br/>Astoria NJ 66309<br/>(906) 217-1470</li>\n<li>Remedios Hester<br/>487-5787 Mollis St.<br/>City of Industry Louisiana 67973<br/>(614) 514-1269</li>\n<li>Jasper Carney<br/>1195 Lobortis Rd.<br/>New Orleans New Hampshire 71983<br/>(763) 409-5446</li>\n<li>Vielka Nielsen<br/>Ap #517-7326 Elementum Rd.<br/>Fort Smith North Dakota 79637<br/>(836) 292-5324</li>\n<li>Wilma Pace<br/>Ap #676-6532 Odio Rd.<br/>Darlington CO 06963<br/>(926) 709-3295</li>\n<li>Palmer Gay<br/>557-2026 Purus St.<br/>Watertown TN 07367<br/>(963) 356-9268</li>\n<li>Lyle Sutton<br/>Ap #250-9843 Elementum St.<br/>South Gate Missouri 68999<br/>(736) 522-8584</li>\n<li>Ina Burt<br/>Ap #130-1685 Ut Street<br/>Tyler KS 73510<br/>(410) 483-0352</li>\n<li>Cleo Best<br/>282-8351 Tincidunt Ave<br/>Sedalia Utah 53700<br/>(252) 204-1434</li>\n<li>Hu Park<br/>1429 Netus Rd.<br/>Reedsport NY 48247<br/>(874) 886-4174</li>\n<li>Liberty Walton<br/>343-6527 Purus. Avenue<br/>Logan NV 12657<br/>(581) 379-7573</li>\n<li>Aaron Trujillo<br/>Ap #146-3132 Cras Rd.<br/>Kingsport NH 56618<br/>(983) 632-8597</li>\n<li>Elmo Lopez<br/>Ap #481-7473 Cum Rd.<br/>Yorba Linda South Carolina 28423<br/>(295) 983-3476</li>\n<li>Emerson Espinoza<br/>Ap #247-5577 Tincidunt St.<br/>Corpus Christi WI 97020<br/>(873) 392-8802</li>\n<li>Daniel Malone<br/>2136 Adipiscing Av.<br/>Lima RI 93490<br/>(360) 669-3923</li>\n<li>Dante Bennett<br/>481-8762 Nulla Street<br/>Dearborn OR 62401<br/>(840) 987-9449</li>\n<li>Sade Higgins<br/>Ap #287-3260 Ut St.<br/>Wilmington OR 05182<br/>(422) 517-6053</li>\n<li>Zorita Anderson<br/>1964 Facilisis Avenue<br/>Bell Gardens Texas 87065<br/>(126) 940-2753</li>\n<li>Jordan Calderon<br/>430-985 Eleifend St.<br/>Duluth Washington 92611<br/>(427) 930-5255</li>\n<li>Ivor Delgado<br/>Ap #310-1678 Ut Av.<br/>Santa Barbara MT 88317<br/>(689) 721-5145</li>\n<li>Pascale Patton<br/>P.O. Box 399 4275 Amet Street<br/>West Allis NC 36734<br/>(676) 334-2174</li>\n<li>Nasim Strong<br/>Ap #630-3889 Nulla. Street<br/>Watervliet Oklahoma 70863<br/>(437) 994-5270</li>\n<li>Keaton Underwood<br/>Ap #636-8082 Arcu Avenue<br/>Thiensville Maryland 19587<br/>(564) 908-6970</li>\n<li>Keegan Blair<br/>Ap #761-2515 Egestas. Rd.<br/>Manitowoc TN 07528<br/>(577) 333-6244</li>\n<li>Tamara Howe<br/>3415 Lobortis. Avenue<br/>Rocky Mount WA 48580<br/>(655) 840-6139</li>\n </ul> </body></html>\n'

In [98]:
re.findall('\(\d{3}\) \d{3}-\d{4}',data)

['(257) 563-7401',
 '(372) 587-2335',
 '(786) 713-8616',
 '(793) 151-6230',
 '(492) 709-6392',
 '(654) 393-5734',
 '(404) 960-3807',
 '(314) 244-6306',
 '(947) 278-5929',
 '(684) 579-1879',
 '(389) 737-2852',
 '(660) 663-4518',
 '(608) 265-2215',
 '(959) 119-8364',
 '(468) 353-2641',
 '(248) 675-4007',
 '(939) 353-1107',
 '(570) 873-7090',
 '(302) 259-2375',
 '(717) 450-4729',
 '(453) 391-4650',
 '(559) 104-5475',
 '(387) 142-9434',
 '(516) 745-4496',
 '(326) 677-3419',
 '(746) 679-2470',
 '(455) 430-0989',
 '(490) 936-4694',
 '(985) 834-8285',
 '(662) 661-1446',
 '(802) 668-8240',
 '(477) 768-9247',
 '(791) 239-9057',
 '(832) 109-0213',
 '(837) 196-3274',
 '(268) 442-2428',
 '(850) 676-5117',
 '(861) 546-5032',
 '(176) 805-4108',
 '(715) 912-6931',
 '(993) 554-0563',
 '(357) 616-5411',
 '(121) 347-0086',
 '(304) 506-6314',
 '(425) 288-2332',
 '(145) 987-4962',
 '(187) 582-9707',
 '(750) 558-3965',
 '(492) 467-3131',
 '(774) 914-2510',
 '(888) 106-8550',
 '(539) 567-3573',
 '(693) 337-2849',
 '(545) 604-9386',
 '(221) 156-5026',
 '(414) 876-0865',
 '(932) 726-8645',
 '(726) 710-9826',
 '(622) 594-1662',
 '(948) 600-8503',
 '(605) 900-7508',
 '(716) 977-5775',
 '(368) 239-8275',
 '(725) 342-0650',
 '(711) 993-5187',
 '(882) 399-5084',
 '(287) 755-9948',
 '(659) 551-3389',
 '(275) 730-6868',
 '(725) 757-4047',
 '(314) 882-1496',
 '(639) 360-7590',
 '(168) 222-1592',
 '(896) 303-1164',
 '(203) 982-6130',
 '(906) 217-1470',
 '(614) 514-1269',
 '(763) 409-5446',
 '(836) 292-5324',
 '(926) 709-3295',
 '(963) 356-9268',
 '(736) 522-8584',
 '(410) 483-0352',
 '(252) 204-1434',
 '(874) 886-4174',
 '(581) 379-7573',
 '(983) 632-8597',
 '(295) 983-3476',
 '(873) 392-8802',
 '(360) 669-3923',
 '(840) 987-9449',
 '(422) 517-6053',
 '(126) 940-2753',
 '(427) 930-5255',
 '(689) 721-5145',
 '(676) 334-2174',
 '(437) 994-5270',
 '(564) 908-6970',
 '(577) 333-6244',
 '(655) 840-6139']

# Numpy - Numerical Python Library or Package

**Website for Numpy** https://numpy.org/

**Its a well optimised C code which makes the processing faster**

In [99]:
import numpy as np

In [100]:
np.__version__

'1.21.5'

**Array is a basic data structure in numpy**

    When we want to do complex calculation we need numpy
        a) Creation of arrays
        b) Perform several operations on the arrays
        c) Integral calculus 
        d) Differential equations
        e) Statistics related operations

**What is an array**
    
    a) An indexed collection of homogenous data elements 
    
    b) It is most commonly used in the programming languages like c,c++ or java
    
    c) By default we dont have the array in Python, we have other data structures like list, tuple, etc

In [107]:
ages = [21,23,44,33,22,24,21]
type(ages)

list

In [108]:
ages_array = np.array(ages)
type(ages_array)

numpy.ndarray

**Similaries between Lists and Array**

    1) Both can be used to store the data

    2) The order will be preserved in both, indexing and slicing concepts will remain the same
    
    3) Both are mutable in nature, we can change the values

**Differences between Lists and Arrays**

    1) List is by default comes in with Python, however we need numpy package to get arrays
    
    2) List can contain heterogenous data however, arrays can have homogeneous data
    
    3) On the list we cannot perform vector operationsm we can do that in the arrays
    
    4) Arrays consumes less memory than lists
    
    5) Arrays are superfast when we compare it with lists
    
    6) Arrays are more convinient for doing complex mathematical calculations

In [112]:
ages*3

[21,
 23,
 44,
 33,
 22,
 24,
 21,
 21,
 23,
 44,
 33,
 22,
 24,
 21,
 21,
 23,
 44,
 33,
 22,
 24,
 21]

In [111]:
ages_array*3

array([ 63,  69, 132,  99,  66,  72,  63])

**In the array string takes the priority, if string is not there than float will takes the priority, if float is not there than integer will takes the priority, and last boolean takes the priority**

In [122]:
list1 = [True]

In [124]:
array1= np.array(list1)

In [125]:
array1

array([ True])

**Arrays are faster than lists**

In [127]:
sales = [3432,3321,2312,1433]
profit = [433,233,221,231]

for i in range(0,len(sales)):
    print(profit[i]/sales[i])

0.12616550116550115
0.07015959048479374
0.09558823529411764
0.1612002791346825

In [128]:
sales_array = np.array(sales)
profit_array = np.array(profit)

In [129]:
sales_array

array([3432, 3321, 2312, 1433])

In [130]:
profit_array

array([433, 233, 221, 231])

In [131]:
profit_array/sales_array

array([0.1261655 , 0.07015959, 0.09558824, 0.16120028])

In [135]:
sales_array[1]=2222

**Attributes** - Which is giving us the property of an array

In [139]:
sales_array.shape

(4,)

In [140]:
sales_array.size

4

In [141]:
sales_array.ndim

1

**Functions**

In [143]:
sales_array

array([3432, 2222, 2312, 1433])

In [142]:
sales_array.mean()

2349.75

**How to create a matrix - 2 dimension array**

In [144]:
sales_us = [4332,2112,2423,2111]
sales_eu = [4443,2332,1222,1122]
sales_ind = [4444,2232,1343,3333]

In [146]:
sales_matrix = np.array([sales_us,sales_eu,sales_ind])

In [147]:
sales_matrix

array([[4332, 2112, 2423, 2111],
       [4443, 2332, 1222, 1122],
       [4444, 2232, 1343, 3333]])

In [148]:
sales_matrix[2,2]

1343

In [152]:
sales_matrix[1:,1:3]

array([[2332, 1222],
       [2232, 1343]])

In [151]:
sales_matrix[1:3,1:3]

array([[2332, 1222],
       [2232, 1343]])

In [157]:
sales_matrix.T.shape

(4, 3)

In [156]:
sales_matrix.shape

(3, 4)

In [158]:
profit_us = [132,112,123,111]
profit_eu = [243,232,222,222]
profit_ind = [344,332,343,333]

In [159]:
profit_matrix = np.array([profit_us,profit_eu,profit_ind])

In [161]:
profit_matrix.shape

(3, 4)

In [162]:
sales_matrix

array([[4332, 2112, 2423, 2111],
       [4443, 2332, 1222, 1122],
       [4444, 2232, 1343, 3333]])

In [163]:
profit_matrix

array([[132, 112, 123, 111],
       [243, 232, 222, 222],
       [344, 332, 343, 333]])

In [165]:
np.round(profit_matrix/sales_matrix,2)

array([[0.03, 0.05, 0.05, 0.05],
       [0.05, 0.1 , 0.18, 0.2 ],
       [0.08, 0.15, 0.26, 0.1 ]])

In [166]:
np.round(profit_matrix+sales_matrix,2)

array([[4464, 2224, 2546, 2222],
       [4686, 2564, 1444, 1344],
       [4788, 2564, 1686, 3666]])

In [167]:
np.round(profit_matrix-sales_matrix,2)

array([[-4200, -2000, -2300, -2000],
       [-4200, -2100, -1000,  -900],
       [-4100, -1900, -1000, -3000]])

In [168]:
np.round(profit_matrix*sales_matrix,2)

array([[ 571824,  236544,  298029,  234321],
       [1079649,  541024,  271284,  249084],
       [1528736,  741024,  460649, 1109889]])

In [173]:
import pandas as pd

In [175]:
pd.DataFrame(sales_matrix,columns=['Q1','Q2','Q3','Q4'])

     Q1    Q2    Q3    Q4
0  4332  2112  2423  2111
1  4443  2332  1222  1122
2  4444  2232  1343  3333

In [177]:
np.mean(sales_matrix)

2620.75

In [178]:
sales_matrix.mean()

2620.75

**When we are passing axis = 1 that means we are calculating the mean row by row**

In [179]:
np.mean(sales_matrix,axis=1)

array([2744.5 , 2279.75, 2838.  ])

**When we are passing axis = 0 that means we are calculating the mean column by column**

In [180]:
np.mean(sales_matrix,axis=0)

array([4406.33333333, 2225.33333333, 1662.66666667, 2188.66666667])

In [182]:
np.median(sales_matrix,axis=1)

array([2267.5, 1777. , 2782.5])

In [181]:
np.median(sales_matrix,axis=0)

array([4443., 2232., 1343., 2111.])

In [185]:
np.std(sales_matrix,axis=1)

array([ 925.32386222, 1336.1886796 , 1164.74482184])

In [183]:
np.std(sales_matrix,axis=0)

array([ 52.56318949,  89.93825042, 539.90143133, 904.30611828])

In [187]:
sales_matrix[np.where(sales_matrix>4000)]

array([4332, 4443, 4444])

In [189]:
sales_matrix

array([[4332, 2112, 2423, 2111],
       [4443, 2332, 1222, 1122],
       [4444, 2232, 1343, 3333]])

**In the below output the left part is the index of the rows and the right part is the index of the columns**

In [188]:
np.where(sales_matrix>4000)

(array([0, 1, 2], dtype=int64), array([0, 0, 0], dtype=int64))

# Pandas - To read the data from the external sources

In [190]:
import pandas as pd

In [191]:
pd.__version__

'1.4.4'

**Website for Pandas** https://pandas.pydata.org/

In [192]:
student_details = {'stuid':[1,2,3,4,5], 'stuname':['A','B','C','D','E'], 'sturegion':['N','S','S','E','W']}

In [193]:
student_details

{'stuid': [1, 2, 3, 4, 5],
 'stuname': ['A', 'B', 'C', 'D', 'E'],
 'sturegion': ['N', 'S', 'S', 'E', 'W']}

In [194]:
student_marks = {'stuid':[1,2,3,4,6], 'stusub':['Py','R','SQL','Py','Tab'], 'stumarks':[12,22,11,22,12]}

In [195]:
student_marks

{'stuid': [1, 2, 3, 4, 6],
 'stusub': ['Py', 'R', 'SQL', 'Py', 'Tab'],
 'stumarks': [12, 22, 11, 22, 12]}

In [196]:
df1 = pd.DataFrame(student_details)

In [197]:
df2 = pd.DataFrame(student_marks)

In [198]:
df1

   stuid stuname sturegion
0      1       A         N
1      2       B         S
2      3       C         S
3      4       D         E
4      5       E         W

In [199]:
df2

   stuid stusub  stumarks
0      1     Py        12
1      2      R        22
2      3    SQL        11
3      4     Py        22
4      6    Tab        12

**inner join** - Only common records with participate i.e. Stuid 1,2,3,4, By default merge give the output as a inner join. Joining is happening on the common column. We can use on= as well when there are multiple common columns but we want to join on any specific column. 

Lets assume there are 4 common columns, and I want to join on 2 common columns in that case we will write on=['stuid','stuname']

In [208]:
pd.merge(df1,df2,on=['stuid'],how='inner')

   stuid stuname sturegion stusub  stumarks
0      1       A         N     Py        12
1      2       B         S      R        22
2      3       C         S    SQL        11
3      4       D         E     Py        22

**left outer join** - All the records from the left table will participate and matching records from the right table will participate. Also, the table which we are putting first in the bracket python considers that as a left table

In [207]:
pd.merge(df1,df2,on='stuid',how='left')

   stuid stuname sturegion stusub  stumarks
0      1       A         N     Py      12.0
1      2       B         S      R      22.0
2      3       C         S    SQL      11.0
3      4       D         E     Py      22.0
4      5       E         W    NaN       NaN

**right outer join** - All the records from the right table will participate and matching records from the left table will participate. Also, the table which we are putting second in the bracket python considers that as a right table

In [209]:
pd.merge(df1,df2,on='stuid',how='right')

   stuid stuname sturegion stusub  stumarks
0      1       A         N     Py        12
1      2       B         S      R        22
2      3       C         S    SQL        11
3      4       D         E     Py        22
4      6     NaN       NaN    Tab        12

**full outer join** - All the records from both the tables will participate.

In [210]:
pd.merge(df1,df2,on='stuid',how='outer')

   stuid stuname sturegion stusub  stumarks
0      1       A         N     Py      12.0
1      2       B         S      R      22.0
2      3       C         S    SQL      11.0
3      4       D         E     Py      22.0
4      5       E         W    NaN       NaN
5      6     NaN       NaN    Tab      12.0

In [211]:
student_details = {'stuid':[1,2,3,4,5], 'stuname':['A','B','C','D','E'], 'sturegion':['N','S','S','E','W']}
student_marks = {'stu_id':[1,2,3,4,6], 'stusub':['Py','R','SQL','Py','Tab'], 'stumarks':[12,22,11,22,12]}

In [212]:
df1 = pd.DataFrame(student_details)
df2 = pd.DataFrame(student_marks)

In [213]:
df1

   stuid stuname sturegion
0      1       A         N
1      2       B         S
2      3       C         S
3      4       D         E
4      5       E         W

In [214]:
df2

   stu_id stusub  stumarks
0       1     Py        12
1       2      R        22
2       3    SQL        11
3       4     Py        22
4       6    Tab        12

**When we have the different column names we can go with left_on and right_on**

In [216]:
pd.merge(df1,df2,left_on='stuid',right_on='stu_id',how='inner')

   stuid stuname sturegion  stu_id stusub  stumarks
0      1       A         N       1     Py        12
1      2       B         S       2      R        22
2      3       C         S       3    SQL        11
3      4       D         E       4     Py        22

In [217]:
pd.merge(df1,df2,left_on='stuid',right_on='stu_id',how='left')

   stuid stuname sturegion  stu_id stusub  stumarks
0      1       A         N     1.0     Py      12.0
1      2       B         S     2.0      R      22.0
2      3       C         S     3.0    SQL      11.0
3      4       D         E     4.0     Py      22.0
4      5       E         W     NaN    NaN       NaN

In [218]:
pd.merge(df1,df2,left_on='stuid',right_on='stu_id',how='right')

   stuid stuname sturegion  stu_id stusub  stumarks
0    1.0       A         N       1     Py        12
1    2.0       B         S       2      R        22
2    3.0       C         S       3    SQL        11
3    4.0       D         E       4     Py        22
4    NaN     NaN       NaN       6    Tab        12

In [219]:
pd.merge(df1,df2,left_on='stuid',right_on='stu_id',how='outer')

   stuid stuname sturegion  stu_id stusub  stumarks
0    1.0       A         N     1.0     Py      12.0
1    2.0       B         S     2.0      R      22.0
2    3.0       C         S     3.0    SQL      11.0
3    4.0       D         E     4.0     Py      22.0
4    5.0       E         W     NaN    NaN       NaN
5    NaN     NaN       NaN     6.0    Tab      12.0

**When we have 3 tables how can we join all those together**

In [220]:
customer_table = {'cust_id':[1,2,3,4,5], 'cust_name':['A','B','C','D','E'], 'cust_region':['N','S','S','W','E']}

loan_table = {'cust_id':[1,2,3,4,5],'loan_id':[10,20,30,40,50],'loan_amt':[123,321,132,134,222]}

agent_table = {'agent_id':[101,102,101,102,102], 'agent_name':['James','John','James','John','John'], 'loan_id':[10,20,30,40,50]}

In [221]:
df1 = pd.DataFrame(customer_table)

In [222]:
df2 = pd.DataFrame(loan_table)

In [223]:
df3 = pd.DataFrame(agent_table)

In [224]:
df1

   cust_id cust_name cust_region
0        1         A           N
1        2         B           S
2        3         C           S
3        4         D           W
4        5         E           E

In [225]:
df2

   cust_id  loan_id  loan_amt
0        1       10       123
1        2       20       321
2        3       30       132
3        4       40       134
4        5       50       222

In [226]:
df3

   agent_id agent_name  loan_id
0       101      James       10
1       102       John       20
2       101      James       30
3       102       John       40
4       102       John       50

In [228]:
pd.merge(pd.merge(df1,df2),df3)

   cust_id cust_name cust_region  loan_id  loan_amt  agent_id agent_name
0        1         A           N       10       123       101      James
1        2         B           S       20       321       102       John
2        3         C           S       30       132       101      James
3        4         D           W       40       134       102       John
4        5         E           E       50       222       102       John

# Union & Union all & Index Join

In [229]:
customer_table_US = {'cust_id':[1,2,3,4,5], 'cust_name':['A','B','C','D','E'], 'cust_region':['N_US','S_US','S_US','W_US','E_US']}

In [230]:
customer_table_US

{'cust_id': [1, 2, 3, 4, 5],
 'cust_name': ['A', 'B', 'C', 'D', 'E'],
 'cust_region': ['N_US', 'S_US', 'S_US', 'W_US', 'E_US']}

In [231]:
customer_table_IND = {'cust_id':[6,7,8,9,5], 'cust_name':['P','Q','R','S','E'], 'cust_region':['N_IND','S_IND','S_IND','W_IND','E_US']}

In [232]:
customer_table_IND

{'cust_id': [6, 7, 8, 9, 5],
 'cust_name': ['P', 'Q', 'R', 'S', 'E'],
 'cust_region': ['N_IND', 'S_IND', 'S_IND', 'W_IND', 'E_US']}

In [233]:
cust_us = pd.DataFrame(customer_table_US)

In [234]:
cust_us

   cust_id cust_name cust_region
0        1         A        N_US
1        2         B        S_US
2        3         C        S_US
3        4         D        W_US
4        5         E        E_US

In [235]:
cust_in = pd.DataFrame(customer_table_IND)

In [236]:
cust_in

   cust_id cust_name cust_region
0        6         P       N_IND
1        7         Q       S_IND
2        8         R       S_IND
3        9         S       W_IND
4        5         E        E_US

**Union all - Where duplicates are entertained**

**When we are passing axis=0, that means its a union or union all**

In [239]:
pd.concat([cust_us,cust_in],axis=0)

   cust_id cust_name cust_region
0        1         A        N_US
1        2         B        S_US
2        3         C        S_US
3        4         D        W_US
4        5         E        E_US
0        6         P       N_IND
1        7         Q       S_IND
2        8         R       S_IND
3        9         S       W_IND
4        5         E        E_US

**When we are passing axis=1 then it is index join**

In [240]:
pd.concat([cust_us,cust_in],axis=1)

   cust_id cust_name cust_region  cust_id cust_name cust_region
0        1         A        N_US        6         P       N_IND
1        2         B        S_US        7         Q       S_IND
2        3         C        S_US        8         R       S_IND
3        4         D        W_US        9         S       W_IND
4        5         E        E_US        5         E        E_US

**Union - Where duplicates are not entertained**

**We are using nested functions to do the tasks, however we can do in step by step also, so doing this as single it will memory efficient as we are not creating the copies of the data, if you dont want to create the copies of the data we can overwrite the data in every step. Also while dropping the column we are passing axis=1 i.e. we are dropping the index column, that means when we want to drop a column we can pass axis=1**

In [246]:
final_output = pd.concat([cust_us,cust_in]).reset_index().drop('index',axis=1).drop_duplicates()

In [253]:
final_output.to_csv('today_data.csv')

**os is the operating system module which can help us to connect and play with the files in the local machine**

**Getcwd is a function which is showing us the Get Current Working Directory**

**Chdir is a function which is helping us to Change the Directory**

In [252]:
import os 
os.getcwd()

'C:\\Users\\rahul\\OneDrive\\Desktop'

In [251]:
os.chdir(r'C:\Users\rahul\OneDrive\Desktop')